Vorlesung/ProPar-RelLogProg.org
# +SETUPFILE: /Users/johannes/Documents/myOrg/org-html-themes/setup/theme-bigblow.setup
#+SETUPFILE: ./theme-bigblow-local.setup
#+TITLE: Relational-logische Programmierung
#+SUBTITLE: Programmierparadigmen
#+AUTHOR: Johannes Brauer
#+OPTIONS:   H:4
#+OPTIONS: num:nil d:nil
#+OPTIONS: toc:nil
#+OPTIONS: reveal_single_file:nil
#+Language:  de
#+STARTUP: latexpreview
#+STARTUP: inlineimages
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
#+REVEAL_THEME: simple
#+REVEAL_TRANS: slide
#+REVEAL_HLEVEL: 1
#+REVEAL_INIT_SCRIPT: dependencies: [ { src: 'plugin/menu/menu.js', async: true },
#+REVEAL_INIT_SCRIPT:                 { src: 'reveal.js/plugin/zoom-js/zoom.js', async: true } ]
#+REVEAL_MARGIN: 0.05
#+REVEAL_EXTRA_CSS: ./mycss/myrevealstyle.css
#+OPTIONS: reveal_control:t

* Einführung
+ Relational-logische Programmierung: Programme spezifizieren
  Relationen zwischen Größen.
+ Logische Programmierung: Programm mit Datenstrukturen: Listen,
  Binärbäume, symbolische Ausdrücke, natürliche Zahlen.
+ Der Ursprung der logischen Programmierung: automatische Theorembeweiser.
+ Sie verlangt eine Änderung der Denkweise:
  1. Strukturierte logische Formeln werden als Relations- (Prozedur-)
     Spezifikationen betrachtet.
  2. Eine Frage zu einer logischen Implikation wird als Relations-
     (Prozedur-) Aufruf betrachtet.
  3. Der Beweis der Implikation ist dann die Berechnung der Antwort.

#+Reveal: split

+ Konkreter: Ein Axiom der Form:\\
  =A if B1 and B2 ... and Bn=\\
  kann als Prozedur in einer Programmiersprache betrachtet werden:
  + =A= ist der Prozedurkopf,
  + die =Bis= bilden ihren Rumpf.
+ Der Versuch =A= zu lösen, wird als Ausführung der Prozedur
  verstanden. Dazu muss der Ausdruck =B1 and B2 ... and Bn= gelöst
  bzw. ausgeführt werden.

* Relationale Programmierung mit Prolog
+ Prolog (Programming in Logic) wurde Anfang der 1970er Jahre von dem
  französischen Informatiker Alain Colmerauer entwickelt.
+ Prolog hat sich als Programmiersprache über die strikte logische
  Basis hinaus entwickelt: Praktische Programmierkonstrukte wie
  arithmetische Operationen, Optimierungshilfmittel und Ein-/Ausgabe
  sind hinzugekommen.
+ Die Darstellungen in den folgenden Abschnitten basieren auf
  cite:Bramer2013 und  cite:Clocksin2003.

** Syntax und Semantik relational-logischer Programme
+ Die Syntax basiert auf einer Teilmenge der Prädikatenkalküls. Ein
 relational-logisches Programm besteht aus einer Menge von Formeln,
  die nach Fakten und Regel unterschieden werden. Beide beschreiben
  bekannte Relationen auf der Problemdomäne.
+ Die Semantik besteht in einer Menge von Antworten auf Fragen.
+ Ein Programm wird ausgeführt durch eine logische Aussage, die auch
  Frage oder /Zielausdruck/ (oder goal oder query) genannt wird.
+ Fragen können Variablen enthalten.
+ Die Beantwortung von Fragen mit Variablen besteht darin,
  Variablenbindungen zu finden, die die Frage „beweisen“.
+ Dies geschieht mithilfe zweier Techniken:
  + Unifikation: Belegung von Variablen in zwei Termen, so dass diese
    gleich werden.
  + Backtracking: Suchstrategie bei der Beweisfindung.
+ Es gibt nur eine primitive Operation: den Unifikationsoperator
  ~=~.
+ Es gibt keine Typen.
** Einstiegsbeispiel
+ Das „Hallo Welt“-Äquivalent für ein Prolog-Programm ist meistens
  eine Wissensdatenbank mit Verwandtschaftsverhältnissen.
  + Eltern: Paul, Elfriede
  + Kinder: Klaus, Claudia, Monika
+ Fakten in Prolog:
  #+BEGIN_SRC prolog
  vater(klaus, paul).
  vater(claudia, paul).
  vater(monika, paul).
  mutter(klaus, elfriede).
  mutter(claudia, elfriede).
  mutter(monika, elfriede).
  verheiratet(paul, elfriede).
  #+END_SRC

*** Start des Prolog-Interpreters
+ Im folgenden wird [[http://www.swi-prolog.org][SWI-Prolog]] benutzt.
+ Nach dem Start des Interpreters und der Konsultation der Faktendatei
  =stammbaum.pl= können Fragen an den Interpreter gestellt werden:
#+BEGIN_SRC prolog
Welcome to SWI-Prolog (threaded, 64 bits, version 7.4.2)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

1 ?- consult('stammbaum.pl').
true.

2 ?- vater(klaus, paul).
true.

3 ?- mutter(claudia, paul).
false.
#+END_SRC
*** Weitere Beispiele für Fragen (Zielausdrücke, goals):
Fragen können Variablen benutzen, die stets mit einem Großbuchstaben
beginnen müssen.
#+BEGIN_SRC prolog
?-  mutter(klaus, elfriede).
    true.
?-  vater(claudia, X).
    X=paul.
?-  vater(peter, X).
    false.
?-  vater(X, paul).
    X=klaus;
    X=claudia;
    X=monika.
?-  verheiratet(X, Y).
    X=paul;
    Y=elfriede.
#+END_SRC
*** Regeln
Nehmen wir an, wir möchten auch Anfragen über die
Schwesterbeziehung in die Datenbasis aufnehmen, um entsprechende
Anfragen beantworten zu können. Dann hat man zwei Möglichkeiten:

1. Neue Fakten hinzufügen:
   #+begin_small
   #+BEGIN_SRC prolog
   schwester(claudia, monika).
   schwester(monika, claudia).
   schwester(klaus, claudia).
   schwester(klaus, monika).
   #+END_SRC
   #+end_small

2. Formulierung einer Regel: =Y= ist Schwester von =X=, falls =Y= 
   weiblich und Mutter von =X= gleich Mutter von =Y= ist und Vater von
   =X= gleich Vater von =Y=.\\
   \\
   Dann muss man nur noch als Fakten festhalten, welche
   Familienmitglieder weiblich sind. Die Regel erlaubt es, aus bekannten 
   Fakten neue herzuleiten!

*** Prolog-Programm mit Schwesterregel

Fakten:
#+BEGIN_SRC prolog
vater(klaus, paul).
vater(claudia, paul).
vater(monika, paul).
mutter(klaus, elfriede).
mutter(claudia, elfriede).
mutter(monika, elfriede).
verheiratet(paul, elfriede).
weiblich(claudia).
weiblich(monika).
weiblich(elfriede).
#+END_SRC

Regeln:
#+begin_small
#+BEGIN_SRC prolog
schwester(X, Y):- weiblich(Y), 
       mutter(X, Z), mutter(Y, Z), 
       vater(X, W), vater(Y, W),
       X \== Y.
#+END_SRC
#+end_small

