Vorlesung/Folien/ProPar-RelLogProg.html
<!DOCTYPE html>
<html lang="de">
<head>
<meta charset="utf-8"/>
<title>Relational-logische Programmierung</title>
<meta name="author" content="(Johannes Brauer)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/simple.css" id="theme"/>

<link rel="stylesheet" href="./mycss/myrevealstyle.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
<link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Relational-logische Programmierung</h1><h2 class="author">Johannes Brauer</h2><p class="date">Created: 2017-09-03 Sun 19:37</p>
</section>

<section>
<section id="slide-orgbb73556">
<h2 id="orgbb73556">Einführung</h2>
<ul>
<li>Relational-logische Programmierung: Programme spezifizieren
Relationen zwischen Größen.</li>
<li>Logische Programmierung: Programm mit Datenstrukturen: Listen,
Binärbäume, symbolische Ausdrücke, natürliche Zahlen.</li>
<li>Der Ursprung der logischen Programmierung: automatische Theorembeweiser.</li>
<li>Sie verlangt eine Änderung der Denkweise:
<ol>
<li>Strukturierte logische Formeln werden als Relations- (Prozedur-)
Spezifikationen betrachtet.</li>
<li>Eine Frage zu einer logischen Implikation wird als Relations-
(Prozedur-) Aufruf betrachtet.</li>
<li>Der Beweis der Implikation ist dann die Berechnung der Antwort.</li>

</ol></li>

</ul>

</section>
<section >

<ul>
<li>Konkreter: Ein Axiom der Form:<br />
<code>A if B1 and B2 ... and Bn</code><br />
kann als Prozedur in einer Programmiersprache betrachtet werden:
<ul>
<li><code>A</code> ist der Prozedurkopf,</li>
<li>die <code>Bis</code> bilden ihren Rumpf.</li>

</ul></li>
<li>Der Versuch <code>A</code> zu lösen, wird als Ausführung der Prozedur
verstanden. Dazu muss der Ausdruck <code>B1 and B2 ... and Bn</code> gelöst
bzw. ausgeführt werden.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgf73d02f">
<h2 id="orgf73d02f">Relationale Programmierung mit Prolog</h2>
<ul>
<li>Prolog (Programming in Logic) wurde Anfang der 1970er Jahre von dem
französischen Informatiker Alain Colmerauer entwickelt.</li>
<li>Prolog hat sich als Programmiersprache über die strikte logische
Basis hinaus entwickelt: Praktische Programmierkonstrukte wie
arithmetische Operationen, Optimierungshilfmittel und Ein-/Ausgabe
sind hinzugekommen.</li>
<li>Die Darstellungen in den folgenden Abschnitten basieren auf
<a class='org-ref-reference' href="#Bramer2013">Bramer2013</a> und  <a class='org-ref-reference' href="#Clocksin2003">Clocksin2003</a>.</li>

</ul>

</section>
<section id="slide-org9aa46fd">
<h3 id="org9aa46fd">Syntax und Semantik relational-logischer Programme</h3>
<ul>
<li>Die Syntax basiert auf einer Teilmenge der Prädikatenkalküls. Ein
relational-logisches Programm besteht aus einer Menge von Formeln,
 die nach Fakten und Regel unterschieden werden. Beide beschreiben
 bekannte Relationen auf der Problemdomäne.</li>
<li>Die Semantik besteht in einer Menge von Antworten auf Fragen.</li>
<li>Ein Programm wird ausgeführt durch eine logische Aussage, die auch
Frage oder <i>Zielausdruck</i> (oder goal oder query) genannt wird.</li>
<li>Fragen können Variablen enthalten.</li>
<li>Die Beantwortung von Fragen mit Variablen besteht darin,
Variablenbindungen zu finden, die die Frage „beweisen“.</li>
<li>Dies geschieht mithilfe zweier Techniken:
<ul>
<li>Unifikation: Belegung von Variablen in zwei Termen, so dass diese
gleich werden.</li>
<li>Backtracking: Suchstrategie bei der Beweisfindung.</li>

</ul></li>
<li>Es gibt nur eine primitive Operation: den Unifikationsoperator
<code>=</code>.</li>
<li>Es gibt keine Typen.</li>

</ul>
</section>
<section id="slide-orgca166f5">
<h3 id="orgca166f5">Einstiegsbeispiel</h3>
<ul>
<li>Das „Hallo Welt“-Äquivalent für ein Prolog-Programm ist meistens
eine Wissensdatenbank mit Verwandtschaftsverhältnissen.
<ul>
<li>Eltern: Paul, Elfriede</li>
<li>Kinder: Klaus, Claudia, Monika</li>

</ul></li>
<li><p>
Fakten in Prolog:
</p>
<div class="org-src-container">

<pre  class="src src-prolog">  vater(klaus, paul).
  vater(claudia, paul).
  vater(monika, paul).
  mutter(klaus, elfriede).
  mutter(claudia, elfriede).
  mutter(monika, elfriede).
  verheiratet(paul, elfriede).</pre>
</pre>
</div></li>

</ul>

</section>
<section id="slide-org1d8392a">
<h4 id="org1d8392a">Start des Prolog-Interpreters</h4>
<ul>
<li>Im folgenden wird <a href="http://www.swi-prolog.org">SWI-Prolog</a> benutzt.</li>
<li>Nach dem Start des Interpreters und der Konsultation der Faktendatei
<code>stammbaum.pl</code> können Fragen an den Interpreter gestellt werden:</li>

</ul>
<div class="org-src-container">

<pre  class="src src-prolog"><span style="color: #BA36A5;">Welcome</span> to <span style="color: #BA36A5;">SWI</span>-<span style="color: #BA36A5;">Prolog</span> (threaded, 64 bits, version 7.4.2)
<span style="color: #BA36A5;">SWI</span>-<span style="color: #BA36A5;">Prolog</span> comes with <span style="color: #BA36A5;">ABSOLUTELY</span> <span style="color: #BA36A5;">NO</span> <span style="color: #BA36A5;">WARRANTY</span>. <span style="color: #BA36A5;">This</span> is free software.
<span style="color: #BA36A5;">Please</span> run ?- license. <span style="color: #006699;">for</span> legal details.

<span style="color: #BA36A5;">For</span> online help and background, visit http://www.<span style="color: #006699;">swi</span>-prolog.<span style="color: #006699;">org</span>
<span style="color: #BA36A5;">For</span> built-in help, use ?- help(<span style="color: #BA36A5;">Topic</span>). <span style="color: #006699;">or</span> ?- apropos(<span style="color: #BA36A5;">Word</span>).

1 ?- consult(<span style="color: #008000;">'stammbaum.pl'</span>).
true.

2 ?- vater(klaus, paul).
true.

3 ?- mutter(claudia, paul).
false.</pre>
</pre>
</div>
</section>
<section id="slide-orgfad3aa8">
<h4 id="orgfad3aa8">Weitere Beispiele für Fragen (Zielausdrücke, goals):</h4>
<p>
Fragen können Variablen benutzen, die stets mit einem Großbuchstaben
beginnen müssen.
</p>
<div class="org-src-container">

<pre  class="src src-prolog">?-  mutter(klaus, elfriede).
    true.
?-  vater(claudia, <span style="color: #BA36A5;">X</span>).
    <span style="color: #BA36A5;">X</span>=paul.
?-  vater(peter, <span style="color: #BA36A5;">X</span>).
    false.
?-  vater(<span style="color: #BA36A5;">X</span>, paul).
    <span style="color: #BA36A5;">X</span>=klaus<span style="color: #0000FF;">;</span>
    <span style="color: #BA36A5;">X</span>=claudia<span style="color: #0000FF;">;</span>
    <span style="color: #BA36A5;">X</span>=monika.
?-  verheiratet(<span style="color: #BA36A5;">X</span>, <span style="color: #BA36A5;">Y</span>).
    <span style="color: #BA36A5;">X</span>=paul<span style="color: #0000FF;">;</span>
    <span style="color: #BA36A5;">Y</span>=elfriede.</pre>
</pre>
</div>
</section>
<section id="slide-org434f42c">
<h4 id="org434f42c">Regeln</h4>
<p>
Nehmen wir an, wir möchten auch Anfragen über die
Schwesterbeziehung in die Datenbasis aufnehmen, um entsprechende
Anfragen beantworten zu können. Dann hat man zwei Möglichkeiten:
</p>

<ol>
<li><p>
Neue Fakten hinzufügen:
</p>
<div class="small">
<div class="org-src-container">

<pre  class="src src-prolog">   schwester(claudia, monika).
   schwester(monika, claudia).
   schwester(klaus, claudia).
   schwester(klaus, monika).</pre>
</pre>
</div>

</div></li>

<li>Formulierung einer Regel: <code>Y</code> ist Schwester von <code>X</code>, falls <code>Y</code> 
weiblich und Mutter von <code>X</code> gleich Mutter von <code>Y</code> ist und Vater von
<code>X</code> gleich Vater von <code>Y</code>.<br />
<br />
Dann muss man nur noch als Fakten festhalten, welche
Familienmitglieder weiblich sind. Die Regel erlaubt es, aus bekannten 
Fakten neue herzuleiten!</li>

</ol>

</section>
<section id="slide-org68b0bd4">
<h4 id="org68b0bd4">Prolog-Programm mit Schwesterregel</h4>
<p>
Fakten:
</p>
<div class="org-src-container">

<pre  class="src src-prolog"><span style="color: #006699;">vater</span>(klaus, paul).
<span style="color: #006699;">vater</span>(claudia, paul).
<span style="color: #006699;">vater</span>(monika, paul).
<span style="color: #006699;">mutter</span>(klaus, elfriede).
<span style="color: #006699;">mutter</span>(claudia, elfriede).
<span style="color: #006699;">mutter</span>(monika, elfriede).
<span style="color: #006699;">verheiratet</span>(paul, elfriede).
<span style="color: #006699;">weiblich</span>(claudia).
<span style="color: #006699;">weiblich</span>(monika).
<span style="color: #006699;">weiblich</span>(elfriede).</pre>
</pre>
</div>

<p>
Regeln:
</p>
<div class="small">
<div class="org-src-container">

<pre  class="src src-prolog"><span style="color: #006699;">schwester</span>(<span style="color: #BA36A5;">X</span>, <span style="color: #BA36A5;">Y</span>):- weiblich(<span style="color: #BA36A5;">Y</span>), 
       mutter(<span style="color: #BA36A5;">X</span>, <span style="color: #BA36A5;">Z</span>), mutter(<span style="color: #BA36A5;">Y</span>, <span style="color: #BA36A5;">Z</span>), 
       vater(<span style="color: #BA36A5;">X</span>, <span style="color: #BA36A5;">W</span>), vater(<span style="color: #BA36A5;">Y</span>, <span style="color: #BA36A5;">W</span>),
       <span style="color: #BA36A5;">X</span> \== <span style="color: #BA36A5;">Y</span>.</pre>
</pre>
</div>

</div>

</section>
