Vorlesung/ProPar-RelLogProg.org
*** Beispielanfragen

#+begin_smaller
#+BEGIN_SRC prolog
?- schwester(klaus, claudia).
#+END_SRC
#+end_smaller

Das Prolog-System muss

1. prüfen, ob =claudia= weiblich ist (Faktum)
2. erkennen, dass =mutter(klaus,Z)= und =mutter(claudia,Z)= gelten für
   =Z=elfriede=
3. erkennen, dass =vater(klaus,W)= und =vater(claudia,W)= gelten für
   =W=Paul=
4. daher =true= ausgeben

#+Reveal: split

#+begin_smaller 
#+BEGIN_SRC prolog
?- schwester(klaus, X).
#+END_SRC
#+end_smaller

-  Die Frage bedeutet: Wer sind die Schwestern von Klaus?
-  Das Prolog-System durchsucht seine Datenbank von Fakten (und Regeln)
   in fester Reihenfolge; nämlich:
   1. von oben nach unten
   2. von links nach rechts
-  Daher liefert die Anfrage die Antwort:

   #+begin_small
   #+BEGIN_SRC prolog
   X=claudia;
   X=monika;
   false.
   #+END_SRC
   #+end_small

#+Reveal: split

#+begin_smaller
#+BEGIN_SRC prolog
?- schwester(X, Y).
#+END_SRC
#+end_smaller

Es ist nicht schwer zu sehen, dass aufgrund der o.g. Auswertestrategie
folgende Ausgabe erzeugt wird:

#+begin_small
#+BEGIN_SRC prolog
X = klaus, Y = claudia ;
X = monika, Y = claudia ;
X = klaus, Y = monika ;
X = claudia, Y = monika ;
false.
#+END_SRC
#+end_small

** Basiskonzepte von Prolog
*** Terme
+ Alle Daten (einschließlich der Prolog-Programme) in Prolog werden
  durch /Terme/ repräsentiert.
+ Ein Term ist:
  + ein /Atom/. Beispiele sind =elmshorn=, =claudia=. Atome beginnen
    mit einem Kleinbuchstaben.
  + eine /Variable/. Variablen beginnen mit einem Großbuchstaben oder
    dem Unterstrich. Ein singulärer Unterstrich bezeichnet die
    /anonyme Variable/, die für „irgendeinen Term” steht.
  + eine /Ganzzahl/ oder eine /Gleitkommazahl/.
  + ein /zusammengesetzter Term/ (compound term):
    + Wenn $t_1, t_2, \ldots ,t_n$ Terme sind, dann ist auch $f(t_1,
      t_2, \ldots ,t_n)$ ein Term. $f$ heißt Funktor und $n$ ist die
      Stelligkeit des zusammengesetzten Terms.\\
      Beispiele: =f(a)=, =g(f(X))=, =+(a, f(X))=
*** Programme
+ Ein Prolog-Programm besteht aus einer Menge von Prädikaten.
+ Prädikate beschreiben Relationen zwischen ihren Argumenten. Logisch
  betrachtet beschreibt ein Prolog-Programm, was gilt.
+ Jedes /Prädikat/
  + besitzt ein Atom als Namen und beliebig viele Argumente.
  + Jedes Argument ist ein Prolog-Term.
  + Ein Prädikat mit dem Namen =Pred= und $n$ Argumenten wird durch
    einen Prädikatsindikator notiert: =Pred/n=. $n$ ist die
    Stelligkeit des Prädikats.
  + Ein Prädikat wird durch eine Menge von /Klauseln/ (s. u.) definiert.
  + Die Klauseln, die ein Prädikat definieren, stellen logische
    Alternativen dar. Wenn eine der Klauseln wahr ist, ist das ganze
    Prädikat war.
*** Klauseln -- Regeln
+ Ein Klausel ist entweder ein /Fakt/ oder eine /Regel/.
+ Eine Regel hat die Form:\\
  =Kopf :- Rumpf.=
  + Die Form des =Kopf= hängt von der Zahl der Argumente des Prädikats
    ab:
    + Besitzt das Prädikat keine Argumente, dann besteht der =Kopf=
      nur aus dem Namen des Prädikats, ist also ein Atom.
    + Andernfalls ist =Kopf= ein zusammengesetzter Term, z. B.:\\
      =schwester(X, Y)=
  + Der =Rumpf= hat die Form: $B_1,\ldots,B_n$, wobei die $B_i$ Terme
    sind, die mit dem Komma konjunktiv verknüpft sind.
  + Die Zeichenfolge =:-= steht für die logische Implikation,
    gerichtet vom Rumpf zum Kopf.
#+Reveal: split
  + Z. B. kann die Regel\\
    : father(Dad, Child) :- parent(Dad, Child), male(Dad).
    wie folgt gelesen werden: =Dad= (eine Variable) ist =father= von
    =Child= (Variable), wenn =Dad= =parent= von =Child= und =Dad=
    =male= ist.
*** Klauseln -- Fakten
+ Ein Faktum wird so aufgeschrieben:\\
  =Kopf.=
+ Dieser Ausdruck ist äquivalent zur Regel:\\
  =Kopf :- true.=
+ Logisch bedeutet das, dass die Regel immer wahr ist, weil das
  Standardprädikat =true/0= immer wahr ist.
*** Starten von Prolog-Programmen 
+ Eingabe von Fragen/Zielausdrücken (queries) am Eingabeprompt des
  Prolog-Interpreters
+ Ein Zielausdruck besteht aus dem Namen eines beliebigen Prädikats
  und seiner Argumente.
+ Eine Frage kann aus der Und-Verknüpfung von mehreren Zielausdrücken
  bestehen. 
+ In einer Frage sind Variabeln existenz-quantifiziert. Eine Frage
  =p(X)= kann so gelesen werden: Existiert eine Variablenbindung für
  X, so dass =p(X)= wahr wird.
+ Wenn eine passende Variablenbindung gefunden werden kann (the goal
  succeeds), antwortet der Interpreter mit einem logisch äquivalenten
  Zielausdruck.
+ Wenn eine Frage mehrere Antworten hat, liefert der Interpreter die
  übrigen auf besondere Anforderung (in SWI-Prolog durch Eingabe von
  Leerzeichen oder Semikolon).

*** Ausführung von Prolog-Programmen
Die operationale Semantik von Prolog
+ Die Ausführung von Prolog-Code kann als ein Spezialfall einer
  /Resolution/ betrachtet werden.
+ Die Resolution ist ein Verfahren der formalen Logik, um die
  Gültigkeit einer logischen Formel zu prüfen. Dabei wird versucht,
  aus der Verneinung der Frage einen Widerspruch abzuleiten.
+ Wenn ein Widerspruch gefunden wird, ist die Frage die logische
  Folgerung aus dem Programm.
+ Ein wichtiger Schritt in diesem Prozess ist die Unifikation von
  Termen.
+ Wird der Kopf einer Klausel für die Unifikation mit einem
  Zielausdruck ausgewählt, wird diese auf die Argumente von beiden
  Termen angewendet.
+ Daraus folgt, dass es in Prolog keine Unterscheidung zwischen Ein-
  und Ausgabeparametern gibt.
  (Vgl. [[file:ProPar-RelProgUebrscht.org::*Beispiel:%20Nat%C3%BCrliche%20Zahlen][Implementierung von natürlichen Zahlen]]!)
#+Reveal: split
+ Sind die Köpfe mehrerer Klauseln mit einem Zielausdruck
  unifizierbar, werden die Alternativen durch /Backtracking/
  abgearbeitet.
+ Informell kann die Ausführungsstrategie von Prolog als Tiefensuche
  (depth-first search) mit /chronologischem Backtracking/ betrachtet werden.

