Vorlesung/Folien/ProPar-RelLogProg.html
<section id="slide-orgcebcc8d">
<h4 id="orgcebcc8d">Beispielanfragen</h4>
<div class="smaller">
<div class="org-src-container">

<pre  class="src src-prolog">?- schwester(klaus, claudia).</pre>
</pre>
</div>

</div>

<p>
Das Prolog-System muss
</p>

<ol>
<li>prüfen, ob <code>claudia</code> weiblich ist (Faktum)</li>
<li>erkennen, dass <code>mutter(klaus,Z)</code> und <code>mutter(claudia,Z)</code> gelten für
<code>Z=elfriede</code></li>
<li>erkennen, dass <code>vater(klaus,W)</code> und <code>vater(claudia,W)</code> gelten für
<code>W=Paul</code></li>
<li>daher <code>true</code> ausgeben</li>

</ol>

</section>
<section >

<div class="smaller">
<div class="org-src-container">

<pre  class="src src-prolog">?- schwester(klaus, <span style="color: #BA36A5;">X</span>).</pre>
</pre>
</div>

</div>

<ul>
<li>Die Frage bedeutet: Wer sind die Schwestern von Klaus?</li>
<li>Das Prolog-System durchsucht seine Datenbank von Fakten (und Regeln)
in fester Reihenfolge; nämlich:
<ol>
<li>von oben nach unten</li>
<li>von links nach rechts</li>

</ol></li>
<li><p>
Daher liefert die Anfrage die Antwort:
</p>

<div class="small">
<div class="org-src-container">

<pre  class="src src-prolog">   <span style="color: #BA36A5;">X</span>=claudia<span style="color: #0000FF;">;</span>
   <span style="color: #BA36A5;">X</span>=monika<span style="color: #0000FF;">;</span>
   false.</pre>
</pre>
</div>

</div></li>

</ul>

</section>
<section >

<div class="smaller">
<div class="org-src-container">

<pre  class="src src-prolog">?- schwester(<span style="color: #BA36A5;">X</span>, <span style="color: #BA36A5;">Y</span>).</pre>
</pre>
</div>

</div>

<p>
Es ist nicht schwer zu sehen, dass aufgrund der o.g. Auswertestrategie
folgende Ausgabe erzeugt wird:
</p>

<div class="small">
<div class="org-src-container">

<pre  class="src src-prolog"><span style="color: #BA36A5;">X</span> = klaus, <span style="color: #BA36A5;">Y</span> = claudia <span style="color: #0000FF;">;</span>
<span style="color: #BA36A5;">X</span> = monika, <span style="color: #BA36A5;">Y</span> = claudia <span style="color: #0000FF;">;</span>
<span style="color: #BA36A5;">X</span> = klaus, <span style="color: #BA36A5;">Y</span> = monika <span style="color: #0000FF;">;</span>
<span style="color: #BA36A5;">X</span> = claudia, <span style="color: #BA36A5;">Y</span> = monika <span style="color: #0000FF;">;</span>
false.</pre>
</pre>
</div>

</div>

</section>
<section id="slide-org54022ab">
<h3 id="org54022ab">Basiskonzepte von Prolog</h3>
<div class="outline-text-3" id="text-org54022ab">
</div></section>
<section id="slide-orgb7c30e2">
<h4 id="orgb7c30e2">Terme</h4>
<ul>
<li>Alle Daten (einschließlich der Prolog-Programme) in Prolog werden
durch <i>Terme</i> repräsentiert.</li>
<li>Ein Term ist:
<ul>
<li>ein <i>Atom</i>. Beispiele sind <code>elmshorn</code>, <code>claudia</code>. Atome beginnen
mit einem Kleinbuchstaben.</li>
<li>eine <i>Variable</i>. Variablen beginnen mit einem Großbuchstaben oder
dem Unterstrich. Ein singulärer Unterstrich bezeichnet die
<i>anonyme Variable</i>, die für „irgendeinen Term” steht.</li>
<li>eine <i>Ganzzahl</i> oder eine <i>Gleitkommazahl</i>.</li>
<li>ein <i>zusammengesetzter Term</i> (compound term):
<ul>
<li>Wenn \(t_1, t_2, \ldots ,t_n\) Terme sind, dann ist auch \(f(t_1,
      t_2, \ldots ,t_n)\) ein Term. \(f\) heißt Funktor und \(n\) ist die
Stelligkeit des zusammengesetzten Terms.<br />
Beispiele: <code>f(a)</code>, <code>g(f(X))</code>, <code>+(a, f(X))</code></li>

</ul></li>

</ul></li>

</ul>
</section>
<section id="slide-orgafcf9dd">
<h4 id="orgafcf9dd">Programme</h4>
<ul>
<li>Ein Prolog-Programm besteht aus einer Menge von Prädikaten.</li>
<li>Prädikate beschreiben Relationen zwischen ihren Argumenten. Logisch
betrachtet beschreibt ein Prolog-Programm, was gilt.</li>
<li>Jedes <i>Prädikat</i>
<ul>
<li>besitzt ein Atom als Namen und beliebig viele Argumente.</li>
<li>Jedes Argument ist ein Prolog-Term.</li>
<li>Ein Prädikat mit dem Namen <code>Pred</code> und \(n\) Argumenten wird durch
einen Prädikatsindikator notiert: <code>Pred/n</code>. \(n\) ist die
Stelligkeit des Prädikats.</li>
<li>Ein Prädikat wird durch eine Menge von <i>Klauseln</i> (s. u.) definiert.</li>
<li>Die Klauseln, die ein Prädikat definieren, stellen logische
Alternativen dar. Wenn eine der Klauseln wahr ist, ist das ganze
Prädikat war.</li>

</ul></li>

</ul>
</section>
<section id="slide-org13a179f">
<h4 id="org13a179f">Klauseln &#x2013; Regeln</h4>
<ul>
<li>Ein Klausel ist entweder ein <i>Fakt</i> oder eine <i>Regel</i>.</li>
<li>Eine Regel hat die Form:<br />
<code>Kopf :- Rumpf.</code>
<ul>
<li>Die Form des <code>Kopf</code> hängt von der Zahl der Argumente des Prädikats
ab:
<ul>
<li>Besitzt das Prädikat keine Argumente, dann besteht der <code>Kopf</code>
nur aus dem Namen des Prädikats, ist also ein Atom.</li>
<li>Andernfalls ist <code>Kopf</code> ein zusammengesetzter Term, z. B.:<br />
<code>schwester(X, Y)</code></li>

</ul></li>
<li>Der <code>Rumpf</code> hat die Form: \(B_1,\ldots,B_n\), wobei die \(B_i\) Terme
sind, die mit dem Komma konjunktiv verknüpft sind.</li>
<li>Die Zeichenfolge <code>:-</code> steht für die logische Implikation,
gerichtet vom Rumpf zum Kopf.</li>

</ul></li>

</ul>
</section>
<section >
<ul>
<li><p>
Z. B. kann die Regel<br />
</p>
<pre class="example">
father(Dad, Child) :- parent(Dad, Child), male(Dad).

</pre>
<p>
wie folgt gelesen werden: <code>Dad</code> (eine Variable) ist <code>father</code> von
<code>Child</code> (Variable), wenn <code>Dad</code> <code>parent</code> von <code>Child</code> und <code>Dad</code>
<code>male</code> ist.
</p></li>

</ul>
</section>
<section id="slide-org01b6699">
<h4 id="org01b6699">Klauseln &#x2013; Fakten</h4>
<ul>
<li>Ein Faktum wird so aufgeschrieben:<br />
<code>Kopf.</code></li>
<li>Dieser Ausdruck ist äquivalent zur Regel:<br />
<code>Kopf :- true.</code></li>
<li>Logisch bedeutet das, dass die Regel immer wahr ist, weil das
Standardprädikat <code>true/0</code> immer wahr ist.</li>

</ul>
</section>
<section id="slide-org9eb1337">
<h4 id="org9eb1337">Starten von Prolog-Programmen</h4>
<ul>
<li>Eingabe von Fragen/Zielausdrücken (queries) am Eingabeprompt des
Prolog-Interpreters</li>
<li>Ein Zielausdruck besteht aus dem Namen eines beliebigen Prädikats
und seiner Argumente.</li>
<li>Eine Frage kann aus der Und-Verknüpfung von mehreren Zielausdrücken
bestehen.</li>
<li>In einer Frage sind Variabeln existenz-quantifiziert. Eine Frage
<code>p(X)</code> kann so gelesen werden: Existiert eine Variablenbindung für
X, so dass <code>p(X)</code> wahr wird.</li>
<li>Wenn eine passende Variablenbindung gefunden werden kann (the goal
succeeds), antwortet der Interpreter mit einem logisch äquivalenten
Zielausdruck.</li>
<li>Wenn eine Frage mehrere Antworten hat, liefert der Interpreter die
übrigen auf besondere Anforderung (in SWI-Prolog durch Eingabe von
Leerzeichen oder Semikolon).</li>

</ul>

</section>
<section id="slide-orge7fea38">
<h4 id="orge7fea38">Ausführung von Prolog-Programmen</h4>
<p>
Die operationale Semantik von Prolog
</p>
<ul>
<li>Die Ausführung von Prolog-Code kann als ein Spezialfall einer
<i>Resolution</i> betrachtet werden.</li>
<li>Die Resolution ist ein Verfahren der formalen Logik, um die
Gültigkeit einer logischen Formel zu prüfen. Dabei wird versucht,
aus der Verneinung der Frage einen Widerspruch abzuleiten.</li>
<li>Wenn ein Widerspruch gefunden wird, ist die Frage die logische
Folgerung aus dem Programm.</li>
<li>Ein wichtiger Schritt in diesem Prozess ist die Unifikation von
Termen.</li>
<li>Wird der Kopf einer Klausel für die Unifikation mit einem
Zielausdruck ausgewählt, wird diese auf die Argumente von beiden
Termen angewendet.</li>
<li>Daraus folgt, dass es in Prolog keine Unterscheidung zwischen Ein-
und Ausgabeparametern gibt.
(Vgl. <a href="ProPar-RelProgUebrscht.html#MissingReference">Implementierung von natürlichen Zahlen</a>!)</li>

</ul>
</section>
<section >
<ul>
<li>Sind die Köpfe mehrerer Klauseln mit einem Zielausdruck
unifizierbar, werden die Alternativen durch <i>Backtracking</i>
abgearbeitet.</li>
<li>Informell kann die Ausführungsstrategie von Prolog als Tiefensuche
(depth-first search) mit <i>chronologischem Backtracking</i> betrachtet werden.</li>

</ul>

</section>
